python/throught_aware_router_demo/2025-03-28_21-03-22/pow_2/experiment_2/benchmark.log
Namespace(backend='vllm', base_url=None, host='127.0.0.1', port=8000, dataset_name='sharegpt', dataset_path='./LARGER_GAP_short_80_long_20_sharegpt_requests.json', model='Qwen/Qwen2.5-1.5B-Instruct', tokenizer=None, num_prompts=1024, sharegpt_output_len=100, random_input_len=None, random_output_len=None, random_range_ratio=0.0, request_rate=inf, seed=1, multi=False, request_rate_range='2,34,2', output_file=None, disable_tqdm=False, disable_stream=False, disable_ignore_eos=False, extra_request_body=None, max_concurrency=64, gen_num_groups=64, gen_prompts_per_group=16, gen_system_prompt_len=2048, gen_question_len=128, gen_output_len=256)

Total number of conversations: 10925
Starting initial single prompt test run...
Initial test run completed. Starting main benchmark run...
100%|██████████| 1024/1024 [05:02<00:00,  3.38it/s]

============ Serving Benchmark Result ============
Backend:                                 vllm      
Traffic request rate:                    inf       
Successful requests:                     1023      
Long requests:                           136       
Short requests:                          887       
Benchmark duration (s):                  302.97    
Total input tokens:                      540979    
Total generated tokens:                  520300    
Total generated tokens (retokenized):    520913    
Request throughput (req/s):              3.38      
Input token throughput (tok/s):          1785.60   
Output token throughput (tok/s):         1717.34   
----------------End-to-End Latency----------------
Mean E2E Latency (ms):                   17313.05  
Median E2E Latency (ms):                 3761.82   
P95 E2E Latency (ms):                    70255.61  
P99 E2E Latency (ms):                    72181.83  
Long requests Mean E2E Latency (ms):     66922.87839048532
Short requests Mean E2E Latency (ms):    9706.581573596377
Long requests Median E2E Latency (ms):   68109.64840149996
Short requests Median E2E Latency (ms):  3666.4864969998234
Long requests P95 E2E Latency (ms):      72185.83822699997
Short requests P95 E2E Latency (ms):     67816.98704889986
Long requests P99 E2E Latency (ms):      72630.77345140008
Short requests P99 E2E Latency (ms):     71592.86825807997
---------------Time to First Token----------------
Mean TTFT (ms):                          554.63    
Median TTFT (ms):                        323.58    
P95 TTFT (ms):                           2319.08   
P99 TTFT (ms):                           2990.55   
Long Requests Mean TTFT (ms):            712.51    
Short Requests Mean TTFT (ms):           530.43    
Long Requests Median TTFT (ms):          535.82    
Short Requests Median TTFT (ms):         281.03    
Long Requests P95 TTFT (ms):             1521.01   
Short Requests P95 TTFT (ms):            2320.56   
Long Requests P99 TTFT (ms):             2924.04   
Short Requests P99 TTFT (ms):            2990.46   
-----Time per Output Token (excl. 1st token)------
Mean TPOT (ms):                          33.10     
Median TPOT (ms):                        33.26     
P99 TPOT (ms):                           40.77     
---------------Inter-token Latency----------------
Mean ITL (ms):                           33.13     
Median ITL (ms):                         43.00     
P99 ITL (ms):                            165.04    
==================================================